Autodesk.Revit.UI.FormaUIMLManager.IsTheEditorStarted
Returns true if the editor is started, false otherwise.
Since:
2027

Autodesk.Revit.UI.FormaUIMLManager.CloseEditorIfOpened
Close the editor if it is opened
Since:
2027

Autodesk.Revit.UI.FormaUIMLManager.StartEditor
Start an editor used to place the area in the active viewport for the Forma ML system.
Since:
2027

Autodesk.Revit.UI.FormaUIMLManager.RegisterExtCallback(Autodesk.Revit.UI.IFormaUIMLCallback)
Set the external callback.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.FormaUIMLManager.GetCallback
Get the current external callback.
Since:
2027

Autodesk.Revit.UI.FormaUIMLManager.GetInstance
Get a reference to the FormaUIMLManager singleton.
Since:
2027

Autodesk.Revit.UI.FormaUIMLManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.FormaUIMLManager
General Forma UI ML manager for Revit.
Since:
2027